## 144 pandas表格形状操作（三）

### melt宽表调整成长表
lookup已经遗弃，官方推荐melt和loc实现lookup操作
#### 参数 id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None, ignore_index=True

In [1]:
import numpy  as np
import pandas as pd
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
col= [list('ABC'), list('DEF')]

In [2]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [10]:
df

   A  B  C
   D  E  F
0  a  1  2
1  b  3  4
2  c  5  6

In [21]:
df.melt(id_vars=[('A','D')],value_vars=[('B','E'),('C','F')],var_name=[('var','name')],value_name='valuename',ignore_index=False)#多级列名，结果自定义列名，对照.是否忽略原来的索引

  (A, D) (var, name)  valuename
0      a           B          1
1      b           B          3
2      c           B          5
0      a           C          2
1      b           C          4
2      c           C          6

In [20]:
df.melt(id_vars=[('A','D')],value_vars=[('B','E'),('C','F')],var_name=[('var','name')],value_name='valuename')#多级列名，结果自定义列名，对照

  (A, D) (var, name)  valuename
0      a           B          1
1      b           B          3
2      c           B          5
3      a           C          2
4      b           C          4
5      c           C          6

In [18]:
df.melt(id_vars=[('A','D')],value_vars=[('B','E'),('C','F')],var_name=['var','name'],value_name='valuename')#多级列名，结果自定义列名，对照

  (A, D) var name  valuename
0      a   B    E          1
1      b   B    E          3
2      c   B    E          5
3      a   C    F          2
4      b   C    F          4
5      c   C    F          6

In [17]:
df.melt(id_vars=[('A','D')],value_vars=[('B','E'),('C','F')],var_name='varname',value_name='valuename') #多级列名，结果自定义列名

  (A, D) varname  valuename
0      a       B          1
1      b       B          3
2      c       B          5
3      a       C          2
4      b       C          4
5      c       C          6

In [15]:
df.melt(id_vars=[('A','D')],value_vars=[('B','E'),('C','F')]) # col_level 指定列名所在层级，用于多级列名

  (A, D) variable_0 variable_1  value
0      a          B          E      1
1      b          B          E      3
2      c          B          E      5
3      a          C          F      2
4      b          C          F      4
5      c          C          F      6

In [14]:
df.melt(id_vars=[('A','D')],value_vars=[('B','E')]) # col_level 指定列名所在层级，用于多级列名

  (A, D) variable_0 variable_1  value
0      a          B          E      1
1      b          B          E      3
2      c          B          E      5

In [12]:
df.melt(id_vars=['A'],value_vars=['B'],col_level=0) # col_level 指定列名所在层级，用于多级列名

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [9]:
df.columns=col

In [8]:
df.melt(id_vars=['A'],value_vars=['B','C'],var_name='varname',value_name='valuename',ignore_index=False) #ignore_index 是否忽略原来的索引

   A varname  valuename
0  a       B          1
1  b       B          3
2  c       B          5
0  a       C          2
1  b       C          4
2  c       C          6

In [6]:
df.melt(id_vars=['A'],value_vars=['B','C'],var_name='varname',value_name='valuename') #var_name,value_name 用于给两个结果列自定义列名

   A varname  valuename
0  a       B          1
1  b       B          3
2  c       B          5
3  a       C          2
4  b       C          4
5  c       C          6

In [4]:
df.melt(id_vars=['A'],value_vars=['B','C']) # 简单的，BC两列的数据“堆”到一起。

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [3]:
df.melt(id_vars=['A'],value_vars=['B']) # 简单的，B调整竖的

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5